{
    "it": {
        "nav_home": "Home",
        "nav_about": "Chi Sono",
        "nav_interests": "Interessi",
        "nav_experiences": "Esperienze",
        "nav_projects": "Progetti",
        "nav_skills": "Competenze",
        "nav_blog": "Blog",
        "nav_moments": "Momenti",
        "nav_contact": "Contatti",
        "hero_greeting": "Ciao!",
        "hero_im": "Sono",
        "hero_subtitle": "Uno Curioso Sviluppatore App e Software",
        "hero_btn_hire": "Contattami",
        "hero_btn_works": "I miei lavori",
        "about_title": "Chi Sono",
        "about_desc_1": "Sono una persona curiosa e tenace, mi dedico completamente a ogni progetto che affronto. Amo il lavoro di squadra e l'interazione con altre persone.",
        "about_desc_2": "Nel tempo libero mi piace uscire con gli amici, andare a pesca ed esplorare la montagna.",
        "about_info_name": "Nome:",
        "about_info_dob": "Data di nascita:",
        "about_info_city": "Città:",
        "interests_title": "I Miei Interessi",
        "interests_desc_1": "Attualmente studio Informatica presso l'Università di Roma Tor Vergata. Ho un interesse particolare per lo sviluppo di applicazioni mobili e software, database e algoritmi.",
        "interests_desc_2": "Altri interessi nel mondo IT? Certamente! Sto imparando il reverse engineering, la sicurezza offensiva e le tecnologie di automazione.",
        "exp_title": "Esperienze e Competizioni",
        "exp_desc": "Le esperienze professionali e gli eventi a cui ho partecipato.",
        "exp_hackathon_title": "Tor Vergata Hackathon - Vincitore",
        "exp_hackathon_desc": "Io e il mio team abbiamo vinto il torneo Hackathon organizzato dal dipartimento di Informatica dell'Università di Roma Tor Vergata.",
        "exp_hackathon_qual": "Qualifica: Vincitore",
        "exp_hackathon_btn": "Vedi repository GitHub",
        "exp_aval_title": "Tor Vergata x Avalanche Hackathon 2025",
        "exp_aval_desc": "L'Hackaton consisteva nella creazione di un progetto decentralizzato e basato sulla blockchain di Avalanche.",
        "exp_aval_qual": "Qualifica: 2° Posto",
        "exp_aval_btn": "Vedi repository GitHub",
        "exp_aiv1_title": "AIV - 1° Anno",
        "exp_aiv1_desc": "Partecipazione al primo anno del corso AIV, introduzione al mondo dei videogiochi e alle tecniche di programmazione di base.",
        "exp_aiv2_title": "AIV - 2° Anno",
        "exp_aiv2_desc": "Partecipazione al secondo anno del corso AIV, progettazione e sviluppo di un videogioco 2D.",
        "exp_aiv3_title": "AIV - 3° Anno",
        "exp_aiv3_desc": "Partecipazione al terzo anno del corso AIV, progettazione e sviluppo di un ulteriore videogioco 2D.",
        "exp_degree_title": "Diploma di Maturità Informatica",
        "exp_degree_desc": "Diplomato in Informatica e Telecomunicazioni, specializzazione in programmazione software e mobile.",
        "exp_degree_grade": "Voto: 99/100",
        "exp_degree_btn": "Richiedi il mio CV da studente",
        "exp_leader_title": "Team leader in competizioni internazionali",
        "exp_leader_desc": "Team leader del Galileo Galilei alle competizioni internazionali di programmazione organizzate da Manpower Group Experis.",
        "exp_cyber_finalist_title": "Cyberchallenge - Finalista",
        "exp_cyber_desc": "Partecipazione alla competizione Cyberchallenge. La sfida era divisa in diverse prove di logica e programmazione.",
        "exp_cyber_participant_title": "Cyberchallenge - Partecipante",
        "proj_title": "I Miei Progetti",
        "proj_desc": "Progetti sviluppati da me. Clicca su ogni card per scoprire maggiori informazioni.",
        "proj_link_desc": "Link è un'applicazione mobile sviluppata durante la pandemia di Covid-19 a solo scopo dimostrativo. L'app permette agli utenti di registrare facilmente e in modo sicuro le persone con cui sono entrati in contatto. Se uno degli utenti segnala di essere risultato positivo al virus, l'app avvisa automaticamente tutte le persone che ha incontrato negli ultimi 14 giorni, avvertendole della potenziale esposizione. Allo stesso modo, gli utenti vengono immediatamente avvisati se qualcuno con cui sono stati in contatto in seguito risulta positivo.",
        "proj_sporty_desc": "Sporty è un'app innovativa pensata per gli appassionati di sport che desiderano organizzare partite o amichevoli in modo facile, veloce e basato sulla posizione. Attraverso un'interfaccia semplice e intuitiva, gli utenti possono selezionare il loro sport preferito, scegliere il livello di difficoltà e specificare l'area della città e la data in cui sono disponibili. L'app visualizza quindi i potenziali avversari o squadre che corrispondono ai criteri, facilitando così la connessione e l'organizzazione dell'evento sportivo.",
        "proj_findem_desc": "Find 'Em è un potente strumento di web automation progettato per assistere i <strong>botter</strong> nell'assicurarsi articoli in edizione limitata in modo più efficiente. Offre un'ampia gamma di funzionalità specializzate, tra cui:<br><br>- un <strong>modulo Queue-it</strong> sviluppato per migliorare le probabilità di superare le sale d'attesa virtuali, dotato di un sistema interno per risolvere i CAPTCHA testuali e contromisure anti-anti-bot;<br><br>- <strong>moduli di checkout automatico</strong> per piattaforme come <strong>Whop</strong>, <strong>Hyper</strong> e <strong>Discord (Nitro)</strong>, completi di solver anti-jigging proprietari;<br><br>- un <strong>monitor delle offerte in tempo reale</strong> per canali Discord selezionati;<br><br>- un <strong>generatore di account Shopify</strong> in grado di creare account illimitati, con supporto integrato per la risoluzione automatica dei CAPTCHA;<br><br>- un <strong>generatore di dati dummy</strong> per operazioni di jigging;<br><br>- un <strong>booster di visualizzazioni su Vinted</strong> per aumentare la visibilità degli articoli gonfiando artificialmente il numero di visualizzazioni;<br><br>- <strong>strumenti per la modifica dei CSV</strong> e un <strong>convertitore di profili</strong> compatibile con svariati sneaker bot.<br><br>Find Em offre una suite di automazione completa e ottimizzata, pensata appositamente per le esigenze del botting moderno.",
        "proj_littlestar_desc": "Littlestar è un'app social pensata per i proprietari di animali domestici che desiderano ampliare la rete sociale del loro amico a quattro zampe. Gli utenti possono creare un profilo per il proprio animale, caricare foto e dettagli, e scoprire altri animali nelle vicinanze registrati sulla piattaforma. L'app funziona come un vero e proprio social network, permettendo ai padroni di interagire, mettere mi piace ai post e chattare direttamente tramite la funzione di messaggistica integrata. Littlestar facilita inoltre l'organizzazione di incontri in spazi condivisi della città, come parchi o aree dedicate, stimolando il divertimento, il gioco e l'interazione sociale sia per gli animali che per le persone che li accompagnano.",
        "proj_holt_desc": "Questo strumento è stato sviluppato come progetto scolastico e si basa sull'analisi dei grafi di Holt per rilevare potenziali situazioni di deadlock nei sistemi operativi che utilizzano la politica di allocazione delle risorse FIFO (First-In, First-Out). L'applicazione accetta come input la rappresentazione di un grafo e, tramite un algoritmo di riduzione, verifica se il grafo è riducibile. Se il grafo non risulta riducibile, viene segnalato un possibile stato di deadlock. Ciò rende lo strumento particolarmente utile per lo studio e la prevenzione dei problemi di concorrenza nei sistemi operativi. Funge da risorsa educativa interattiva per aiutare gli utenti a comprendere il concetto di deadlock e a esplorare tecniche di prevenzione in ambienti a risorse condivise.",
        "proj_btn_github": "Vedi codice su GitHub",
        "blog_title": "Il Mio Blog Open Source",
        "blog_desc": "Articoli e approfondimenti sui miei contributi e progetti open source.",
        "blog_coming_soon": "I miei articoli saranno pubblicati a breve.",
        "blog_read_more": "Leggi di più",
        "proj_more_info": "Più Informazioni",
        "proj_close_info": "Chiudi Info",
        "moments_title": "Momenti",
        "moments_desc": "Alcune immagini scattate durante lo sviluppo dei miei progetti e le esperienze a cui ho partecipato.",
        "moments_link_title": "Sviluppo di Link",
        "moments_link_desc": "Foto scattata nel pieno dello sviluppo dell'app Link. Una sfida difficile ma completata con grande impegno.",
        "moments_sporty_title": "Team di sviluppo Sporty",
        "moments_sporty_desc": "Il team di sviluppo insieme al Professor Amato Luigi nel giorno della presentazione.",
        "moments_infra_title": "Infrastruttura di rete Sporty",
        "moments_infra_desc": "Un piccolo esempio che rappresenta la progettazione dell'infrastruttura del database.",
        "moments_hack_title": "Durante la competizione",
        "moments_hack_desc": "Una foto scattata durante la competizione Hackathon 2024.",
        "moments_hack_award_title": "Premiazione Hackathon 2024",
        "moments_hack_award_desc": "Io e 2 membri del mio team alla cerimonia di premiazione.",
        "moments_findem_title": "Primi passi",
        "moments_findem_desc": "Screenshot scattato durante i primi test del modulo Queue-it per Find 'Em.",
        "contact_title": "Contattami",
        "contact_desc": "Vuoi conoscermi meglio o scoprire di più sui miei progetti? Contattami!",
        "contact_btn_text": "Contattami",
        "footer_info_title": "Info",
        "footer_info_desc": "Questo è il mio portfolio. Se hai domande o vuoi metterti in contatto con me, utilizza uno dei recapiti o social forniti. Grazie!",
        "footer_links_title": "Link Utili",
        "footer_rights": "Tutti i diritti riservati.",
        "contact_form_title": "Inviami un messaggio",
        "contact_form_email_label": "La tua email",
        "contact_form_email_placeholder": "es. mario.rossi@email.com",
        "contact_form_subject_label": "Oggetto",
        "contact_form_subject_placeholder": "Di cosa vorresti parlare?",
        "contact_form_message_label": "Messaggio",
        "contact_form_message_placeholder": "Scrivi qui il tuo messaggio...",
        "contact_form_submit": "Invia messaggio",
        "contact_form_sending": "Invio in corso...",
        "contact_form_success": "Email Inviata!",
        "contact_form_error": "Si è verificato un errore. Riprova più tardi.",
        "contact_form_reset": "Scrivi un altro messaggio",
        "cv_request_subject": "Richiesta CV studente",
        "cv_request_message": "Salve Luca, vorrei richiedere il tuo CV da studente. Attendo tue notizie. Grazie!"
    },
    "en": {
        "nav_home": "Home",
        "nav_about": "About",
        "nav_interests": "My Interests",
        "nav_experiences": "Experiences",
        "nav_projects": "Projects",
        "nav_skills": "Skills",
        "nav_blog": "Blog",
        "nav_moments": "Moments",
        "nav_contact": "Contact",
        "hero_greeting": "Hello!",
        "hero_im": "I'm",
        "hero_subtitle": "A Curious App and Software Developer",
        "hero_btn_hire": "Contact me",
        "hero_btn_works": "My works",
        "about_title": "About Me",
        "about_desc_1": "I am a curious and tenacious person, fully dedicated to every project I take on. I love teamwork and interacting with other people.",
        "about_desc_2": "In my free time, I love hanging out with friends, going fishing, and hiking in the mountains.",
        "about_info_name": "Name:",
        "about_info_dob": "Date of birth:",
        "about_info_city": "City:",
        "interests_title": "My Interests",
        "interests_desc_1": "I am currently studying Computer Science at the University of Rome Tor Vergata. I have a particular interest in mobile applications and software development, databases, and algorithms.",
        "interests_desc_2": "Other interests in the IT world? Definitely! I'm learning reverse engineering, offensive security, and automation technologies.",
        "exp_title": "Experiences and Competitions",
        "exp_desc": "The professional experiences and events I participated in.",
        "exp_hackathon_title": "Tor Vergata Hackathon - Winner",
        "exp_hackathon_desc": "My team and I won the Hackathon tournament organized by the Computer Science department of the University of Rome Tor Vergata.",
        "exp_hackathon_qual": "Qualification: Winner",
        "exp_hackathon_btn": "See GitHub repository",
        "exp_aval_title": "Tor Vergata x Avalanche Hackathon 2025",
        "exp_aval_desc": "The Hackathon consisted of creating a decentralized project based on the Avalanche blockchain.",
        "exp_aval_qual": "Qualification: 2nd Place",
        "exp_aval_btn": "See GitHub repository",
        "exp_aiv1_title": "AIV Participation - 1st year",
        "exp_aiv1_desc": "Participation in the first year of the AIV course, introduction to the world of video games and basic programming techniques.",
        "exp_aiv2_title": "AIV Participation - 2nd year",
        "exp_aiv2_desc": "Participation in the second year of the AIV course, design and development of a 2D video game.",
        "exp_aiv3_title": "AIV Participation - 3rd year",
        "exp_aiv3_desc": "Participation in the third year of the AIV course, design and development of another 2D video game.",
        "exp_degree_title": "Computer Science Degree",
        "exp_degree_desc": "Graduated in Computer Science and Telecommunications, specialization in software and mobile programming.",
        "exp_degree_grade": "Grade: 99/100",
        "exp_degree_btn": "Request my student CV",
        "exp_leader_title": "Team leader at international programming competitions",
        "exp_leader_desc": "Galileo Galilei team leader at international programming competitions organized by Manpower Group Experis.",
        "exp_cyber_finalist_title": "Cyberchallenge - Finalist",
        "exp_cyber_desc": "Participation in the Cyberchallenge competition. The challenge was divided into several tests of logic and programming.",
        "exp_cyber_participant_title": "Cyberchallenge - Participant",
        "proj_title": "My Projects",
        "proj_desc": "Projects developed by me. Click on each card to discover more information.",
        "proj_link_desc": "Link is a mobile application developed during the Covid-19 pandemic for demonstration purposes only. The app allows users to easily and securely log the people they have come into contact with. If one of the users reports testing positive for the virus, the app automatically notifies all individuals they have met in the past 14 days, alerting them of potential exposure. Likewise, users are immediately notified if anyone they’ve been in contact with later tests positive.",
        "proj_sporty_desc": "Sporty is an innovative app designed for sports enthusiasts who want to organize matches or friendly games easily, quickly, and based on location. Through a simple and intuitive interface, users can select their preferred sport, choose a difficulty level, and specify the area of the city and the date they are available. The app then displays potential opponents or teams that match the criteria, making it easy to connect and arrange the sporting event.",
        "proj_findem_desc": "Find 'Em is a powerful web automation tool designed to assist <strong>botters</strong> in securing limited-edition items more efficiently. It offers a wide range of specialized features, including:<br><br>- a <strong>Queue-it module</strong> developed to improve the chances of bypassing virtual waiting rooms, equipped with an in-house system for solving text CAPTCHAs and anti–anti-bot countermeasures;<br><br>- <strong>automatic checkout modules</strong> for platforms such as <strong>Whop</strong>, <strong>Hyper</strong>, and <strong>Discord (Nitro)</strong>, featuring proprietary anti-jigging solvers;<br><br>- a <strong>real-time offer monitor</strong> for selected Discord channels;<br><br>- a <strong>Shopify account generator</strong> capable of creating unlimited accounts, with built-in support for automatic CAPTCHA solving;<br><br>- a <strong>dummy data generator</strong> for jigging purposes;<br><br>- a <strong>Vinted views booster</strong> to increase item visibility by artificially inflating view counts;<br><br>- <strong>CSV editing tools</strong> and a <strong>profile converter</strong> compatible with various sneaker bots.<br><br>Find Em delivers a complete and optimized automation suite tailored for the demands of modern botting.",
        "proj_littlestar_desc": "Littlestar is a social app designed for pet owners who want to expand their furry friend's social network. Users can create a profile for their pet, upload photos and details, and discover other nearby animals registered on the platform. The app functions as a true social network, allowing owners to interact, like posts, and chat directly through the built-in messaging feature. Littlestar also makes it easy to arrange meetups in shared spaces around the city, such as parks or pet-friendly areas, encouraging fun, play, and social interaction for both the animals and their humans.",
        "proj_holt_desc": "This tool was developed as a school project and is based on the analysis of Holt graphs to detect potential deadlock situations in operating systems that use the FIFO (First-In, First-Out) resource allocation policy. The application takes a graph representation as input and, through a reduction algorithm, checks whether the graph is reducible. If the graph is found to be non-reducible, a possible deadlock state is flagged. This makes the tool especially useful for studying and preventing concurrency issues in operating systems. It serves as an interactive educational resource to help users understand the concept of deadlock and explore prevention techniques in shared-resource environments.",
        "proj_btn_github": "View code on GitHub",
        "blog_title": "My Open Source Blog",
        "blog_desc": "Articles and insights on my open source contributions and projects.",
        "blog_coming_soon": "My articles will be published shortly.",
        "blog_read_more": "Read more",
        "proj_more_info": "More Info",
        "proj_close_info": "Close Info",
        "moments_title": "Moments",
        "moments_desc": "Some images taken during the development of my projects and the experiences I participated in.",
        "moments_link_title": "Link development",
        "moments_link_desc": "Photo taken in the middle of the development of the Link app. A difficult challenge but completed with great commitment.",
        "moments_sporty_title": "Sporty development team",
        "moments_sporty_desc": "The development team together with Professor Amato Luigi on presentation day.",
        "moments_infra_title": "Sporty network infrastructure",
        "moments_infra_desc": "A small example representing the design of the database network infrastructure.",
        "moments_hack_title": "During the competition",
        "moments_hack_desc": "A photo taken during the Hackathon 2024 competition.",
        "moments_hack_award_title": "Hackathon 2024 awards",
        "moments_hack_award_desc": "Me and 2 members of my team at the awards ceremony.",
        "moments_findem_title": "First steps",
        "moments_findem_desc": "Screenshot taken during the first tests of the Queue-it module for Find 'Em.",
        "contact_title": "Contact Me",
        "contact_desc": "Do you want to know me better or find out more about my projects? Get in touch!",
        "contact_btn_text": "Contact me",
        "footer_info_title": "Info",
        "footer_info_desc": "This is my portfolio. If you have further questions or want to get in touch with me, please use one of the provided addresses or social networks. Thanks!",
        "footer_links_title": "Quick Links",
        "footer_rights": "All rights reserved.",
        "contact_form_title": "Send me a message",
        "contact_form_email_label": "Your email",
        "contact_form_email_placeholder": "e.g. john.doe@email.com",
        "contact_form_subject_label": "Subject",
        "contact_form_subject_placeholder": "What would you like to talk about?",
        "contact_form_message_label": "Message",
        "contact_form_message_placeholder": "Write your message here...",
        "contact_form_submit": "Send message",
        "contact_form_sending": "Sending...",
        "contact_form_success": "Email Sent!",
        "contact_form_error": "An error occurred. Please try again later.",
        "contact_form_reset": "Write another message",
        "cv_request_subject": "Student CV Request",
        "cv_request_message": "Hi Luca, I would like to request your student CV. Looking forward to hearing from you. Thanks!"
    }
}